art/note/j09.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-18 Tue 21:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6b3f92e">1. MVC 模式</a>
<ul>
<li><a href="#orgee4151e">1.1. What is Java Swing?</a></li>
<li><a href="#orgc278857">1.2. What is the advantages of Java Swing?</a></li>
<li><a href="#org71bfed8">1.3. What is MVC pattern?</a></li>
<li><a href="#org5ec8e4d">1.4. What is component and container in Swing?</a></li>
<li><a href="#org6e4ae12">1.5. Heavyweight and Lightweight</a></li>
<li><a href="#org2a62ac6">1.6. How to layout the windows in Swing?</a></li>
<li><a href="#org20ce77b">1.7. Tell me an example of configuring layout using Swing.</a>
<ul>
<li><a href="#org025abd5">1.7.1. What <code>frame.pack()</code> do in the example?</a></li>
<li><a href="#org6d92736">1.7.2. What does <code>frame.setDefaultCloseOperation(JFrame.EXIT_ON_CLOSE)</code> do in your example?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcba785a">2. <span class="todo TODO">TODO</span> (Holy shit)Swing 图形处理, 绘制颜色的原理</a>
<ul>
<li><a href="#org4f5eb76">2.1. What is Frame?</a></li>
</ul>
</li>
<li><a href="#org90edd5d">3. Lambda Expression</a>
<ul>
<li><a href="#org2ca1554">3.1. Usage of Lambda Expression</a></li>
</ul>
</li>
<li><a href="#org6ae5470">4. 事件机制</a>
<ul>
<li><a href="#org5cd3cbe">4.1. What is event?</a>
<ul>
<li><a href="#org8421f24">4.1.1. </a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge695c59">5. Swing 基本用户组件</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6b3f92e" class="outline-2">
<h2 id="org6b3f92e"><span class="section-number-2">1</span> MVC 模式</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgee4151e" class="outline-3">
<h3 id="orgee4151e"><span class="section-number-3">1.1</span> What is Java Swing?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Java Swing is a lightweight Java graphical user interface (GUI) widget
toolkit that includes a rich set of widgets. It is part of the Java
Foundation Classes (JFC) and includes several packages for developing
rich desktop applications in Java. Swing provides a rich set of
widgets and packages to make sophisticated GUI components for Java
applications. Swing is a Java Foundation Classes [JFC] library and an
extension of the Abstract Window Toolkit <b>[AWT]</b>. Swing offers
much-improved functionality over AWT, new components, expanded
components features, and excellent event handling with drag-and-drop
support.
</p>

<p>
不同平台上 AWT 用户有不同的 Bug. Swing 使用纯 Java 实现. 不再依赖于本
地平台的图形界面
</p>
</div>
</div>

<div id="outline-container-orgc278857" class="outline-3">
<h3 id="orgc278857"><span class="section-number-3">1.2</span> What is the advantages of Java Swing?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Some of the key advantages of Java Swing are:
</p>

<ul class="org-ul">
<li>Platform Independence: Swing is written entirely in Java, which
makes it platform-independent. It can run on any platform that
supports Java, without any modification <span class="underline">1</span>.</li>

<li>Lightweight: Swing components are lightweight and can be easily
customized <span class="underline">2</span>.</li>

<li>Pluggable Look and Feel: Swing provides a pluggable look and feel
that allows developers to change the appearance of their
applications without changing the code <span class="underline">2</span>.</li>

<li>Rich Set of Components: Swing provides a rich set of components such
as text boxes, buttons, split panes, and tables <span class="underline">3</span>.</li>

<li>Event Handling: Swing provides excellent event handling with
drag-and-drop support.</li>
</ul>

<p>
reference: 
</p>
<ol class="org-ol">
<li><a href="https://www.prepbytes.com/blog/java/introduction-to-java-swing/">https://www.prepbytes.com/blog/java/introduction-to-java-swing/</a></li>
<li><a href="https://www.geeksforgeeks.org/introduction-to-java-swing/">https://www.geeksforgeeks.org/introduction-to-java-swing/</a></li>
<li><a href="https://devdojo.com/anvesh_kumar/the-battle-of-javafx-vs-java-swing-which-one-is-best-for-you">https://devdojo.com/anvesh_kumar/the-battle-of-javafx-vs-java-swing-which-one-is-best-for-you</a></li>
</ol>
</div>
</div>

<div id="outline-container-org71bfed8" class="outline-3">
<h3 id="org71bfed8"><span class="section-number-3">1.3</span> What is MVC pattern?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b>MVC</b> (<b>Model-View-Controller</b>) is a pattern in software design commonly
used to implement user interfaces, data, and controlling logic1. It
emphasizes a separation between the software’s business logic and
display <span class="underline">1</span>. This “separation of concerns” provides for a better division
of labor and improved maintenance <span class="underline">1</span>. The pattern divides an interactive
application into three components <span class="underline">2</span>:
</p>

<ol class="org-ol">
<li><p>
Model: The model represents the data and business logic of the
application. 
</p>

<p>
It represents the data and business rules that govern how the data
is stored, processed, and manipulated. The model component is
responsible for retrieving data from a database or other data
source, processing that data, and storing it back in the
database. It also contains the application’s business logic, which
defines how the data should be processed. The model component is
independent of both the view and controller components. This means
that changes to the view or controller components do not affect the
model component.
</p></li>

<li>View: The view represents the user interface of the application.</li>

<li><p>
Controller: The controller acts as an intermediary between the
model and view components.  
</p>

<p>
It receives input from the user and updates both the model and view
components. The controller component is responsible for
interpreting user input and determining how that input should be
processed. It then updates the model component with any changes
that need to be made. Finally, it updates the view component to
reflect any changes that have been made to the model component.
</p></li>
</ol>

<p>
The model component manages the data and business logic of the
application <span class="underline">3</span>. The view component displays the data to the user
<span class="underline">3</span>. The controller component receives input from the user and updates
both the model and view components <span class="underline">3</span>.
</p>

<p>
reference: 
</p>
<ol class="org-ol">
<li><a href="https://developer.mozilla.org/en-US/docs/Glossary/MVC">https://developer.mozilla.org/en-US/docs/Glossary/MVC</a></li>
<li><a href="https://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller">https://en.wikipedia.org/wiki/Model–view–controller</a></li>
<li><a href="https://www.tutorialspoint.com/design_pattern/mvc_pattern.htm">https://www.tutorialspoint.com/design_pattern/mvc_pattern.htm</a></li>
</ol>

<p>
Users interactive with the <b>Controller</b> to make input and watch the
things that is displayed by <b>View</b>. <b>Controller</b> passes the input to
the <b>Model</b>. The <b>Model</b> manipulates with the data and returns a
value. Then the <b>Controller</b> pass the return value to <b>View</b> to renew
the display content.
</p>
</div>
</div>

<div id="outline-container-org5ec8e4d" class="outline-3">
<h3 id="org5ec8e4d"><span class="section-number-3">1.4</span> What is component and container in Swing?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
In Swing, a <b>container</b> is a component that holds other components
<span class="underline">1</span>. It provides a space where a component can be located and aids
with grouping related components together in the GUI <span class="underline">2</span>. A container is
responsible for displaying the components according to your
layout <span class="underline">1</span>. If a button is placed on the top left corner, every time the
window is resized, the button will still be on the top left corner <span class="underline">1</span>.
</p>

<p>
reference:
</p>
<ol class="org-ol">
<li><a href="https://stackoverflow.com/questions/700314/what-is-the-use-of-container-in-swing">https://stackoverflow.com/questions/700314/what-is-the-use-of-container-in-swing</a></li>
<li><a href="https://www.tutorialspoint.com/swing/swing_containers.htm">https://www.tutorialspoint.com/swing/swing_containers.htm</a></li>
</ol>


<p>
In Swing, a <b>component</b> can be defined as a control that can be
represented visually and is usually independent <span class="underline">1</span>. It has got a
specific functionality and is represented as an individual class in
Swing API <span class="underline">1</span>. Swing has a wide range of various components, including
buttons, check boxes, sliders, and list boxes <span class="underline">2</span>. For example, class
JButton in swing API is a button component and provides the
functionality of a button <span class="underline">1</span>.
</p>

<p>
reference: 
</p>
<ol class="org-ol">
<li><a href="https://www.softwaretestinghelp.com/java/java-swing-tutorial/">https://www.softwaretestinghelp.com/java/java-swing-tutorial/</a></li>
<li><a href="https://zetcode.com/javaswing/basicswingcomponents/">https://zetcode.com/javaswing/basicswingcomponents/</a></li>
</ol>
</div>
</div>
