art/note/j09.html

<div id="outline-container-org6e4ae12" class="outline-3">
<h3 id="org6e4ae12"><span class="section-number-3">1.5</span> Heavyweight and Lightweight</h3>
<div class="outline-text-3" id="text-1-5">
<p>
In Java Swing, a <b>component</b> is an independent visual control that can
be added to a <b>container</b> and manipulated separately from other
components. Swing components are derived from the JComponent class and
provide functionality that is common to all components.
</p>

<p>
A <b>container</b> is a component that can hold other components inside
it. 
</p>

<p>
Swing supports two types of containers: <b>heavyweight</b> and <b>lightweight</b>
containers. Heavyweight containers are implemented by the operating
system’s windowing toolkit and are used for top-level containers such
as JFrame and JDialog. Lightweight containers are implemented
entirely in Java and are used for intermediate-level containers such
as JPanel.
</p>
</div>
</div>

<div id="outline-container-org2a62ac6" class="outline-3">
<h3 id="org2a62ac6"><span class="section-number-3">1.6</span> How to layout the windows in Swing?</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Bing:
</p>

<p>
In Java Swing, layout managers are used to arrange components within a
container <span class="underline">1</span>. Layout managers are used to define how components
should be arranged on a container <span class="underline">2</span>. Java provides several layout
managers that can be used to arrange components on a container
<span class="underline">1</span>. Some of the commonly used layout managers are BorderLayout,
FlowLayout, GridLayout, CardLayout, GroupLayout and SpringLayout
<span class="underline">1</span>. You can set a panel’s layout manager using the JPanel
constructor <span class="underline">2</span>.
</p>

<p>
reference: 
</p>
<ol class="org-ol">
<li><a href="https://docs.oracle.com/javase/tutorial/uiswing/layout/visual.html">https://docs.oracle.com/javase/tutorial/uiswing/layout/visual.html</a></li>
<li><a href="https://docs.oracle.com/javase/tutorial/uiswing/layout/using.html">https://docs.oracle.com/javase/tutorial/uiswing/layout/using.html</a></li>
</ol>
</div>
</div>

<div id="outline-container-org20ce77b" class="outline-3">
<h3 id="org20ce77b"><span class="section-number-3">1.7</span> Tell me an example of configuring layout using Swing.</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Bing: 
</p>

<p>
Here’s an example of configuring layout using Swing:
</p>
<pre class="example">
import java.awt.*;
import javax.swing.*;

public class LayoutExample {
    public static void main(String[] args) {
        JFrame frame = new JFrame("Layout Example");
        // set exit if window closed
        frame.setDefaultCloseOperation(JFrame.EXIT_ON_CLOSE);
        // get the content pane. 
        Container contentPane = frame.getContentPane();
        // set the layout method.
        contentPane.setLayout(new BorderLayout());
        // initialize button.
        JButton button1 = new JButton("Button 1");
        JButton button2 = new JButton("Button 2");
        JButton button3 = new JButton("Button 3");
        // add button to contentPane.
        contentPane.add(button1, BorderLayout.NORTH);
        contentPane.add(button2, BorderLayout.CENTER);
        contentPane.add(button3, BorderLayout.SOUTH);
        // see the question below
        frame.pack();
        // make things visible
        frame.setVisible(true);
    }
}
</pre>

<p>
This example uses the BorderLayout layout manager to arrange three buttons on a container. The buttons are added to the container using the add() method. The pack() method is used to resize the frame so that all the components are at their preferred size. The setVisible() method is used to make the frame visible.
</p>
</div>

<div id="outline-container-org025abd5" class="outline-4">
<h4 id="org025abd5"><span class="section-number-4">1.7.1</span> What <code>frame.pack()</code> do in the example?</h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
The pack() method is defined as a Window class in Java and it sizes
the frame so that all its contents are at or above their preferred
sizes1. If you don’t set frame size there will be a 0 pixel width and
0 pixel height window/frame, so you won’t even see it1. The pack()
method is used to resize the frame so that all the components are at
their preferred size2.
</p>

<p>
reference: 
</p>
<ol class="org-ol">
<li><a href="https://stackoverflow.com/questions/22982295/what-does-pack-do">https://stackoverflow.com/questions/22982295/what-does-pack-do</a></li>
<li><a href="https://stackoverflow.com/questions/25335064/how-do-i-use-jframe-pack">https://stackoverflow.com/questions/25335064/how-do-i-use-jframe-pack</a></li>
</ol>
</div>
</div>

<div id="outline-container-org6d92736" class="outline-4">
<h4 id="org6d92736"><span class="section-number-4">1.7.2</span> What does <code>frame.setDefaultCloseOperation(JFrame.EXIT_ON_CLOSE)</code> do in your example?</h4>
<div class="outline-text-4" id="text-1-7-2">
<p>
The setDefaultCloseOperation(JFrame.EXIT<sub>ON</sub><sub>CLOSE</sub>) method sets the
default close operation for the frame1. In this example, it sets the
close operation to exit the application when the frame is closed2.
</p>

<p>
reference: 
</p>
<ol class="org-ol">
<li><a href="https://chortle.ccsu.edu/java5/Notes/chap56/ch56_9.html">https://chortle.ccsu.edu/java5/Notes/chap56/ch56_9.html</a></li>
<li><a href="https://stackoverflow.com/questions/32077449/whats-the-point-of-setdefaultcloseoperationwindowconstants-exit-on-close">https://stackoverflow.com/questions/32077449/whats-the-point-of-setdefaultcloseoperationwindowconstants-exit-on-close</a></li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcba785a" class="outline-2">
<h2 id="orgcba785a"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> (Holy shit)Swing 图形处理, 绘制颜色的原理</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4f5eb76" class="outline-3">
<h3 id="org4f5eb76"><span class="section-number-3">2.1</span> What is Frame?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A frame 
</p>
</div>
</div>
</div>

<div id="outline-container-org90edd5d" class="outline-2">
<h2 id="org90edd5d"><span class="section-number-2">3</span> Lambda Expression</h2>
<div class="outline-text-2" id="text-3">
<p>
Lambda表达式是Java 8中引入的一种新特性。Lambda表达式是一种短小的代码块，它接受参数并返回值。Lambda表达式类似于方法，但它们不需要名称，并且可以直接在方法体中实现。Lambda表达式的最简单形式包含一个参数和一个表达式。这里是一个例子：
</p>

<pre class="example">
public class LambdaExample {
   public static void main(String args[]) {
      // lambda expression
      HelloWorld hello = (name) -&gt; {
         System.out.println("Hello " + name);
      };
      hello.greet("world");
   }
}
interface HelloWorld {
   void greet(String name);
}
</pre>

<p>
这个例子定义了一个接口HelloWorld，它只有一个方法greet，该方法接受一个
字符串参数name。然后，我们定义了一个lambda表达式，该表达式实现了
HelloWorld 接口中的greet方法。在main方法中，我们创建了一个HelloWorld对
象hello，并调用了它的greet方法。
</p>
</div>

<div id="outline-container-org2ca1554" class="outline-3">
<h3 id="org2ca1554"><span class="section-number-3">3.1</span> Usage of Lambda Expression</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Bing: 
</p>

<p>
Lambda表达式的使用场景有很多，其中之一是当我们想要稍后执行一段代码时，
可以使用Lambda表达式。Lambda表达式的实际目的是延迟执行，有许多原因可以
延迟执行代码，例如：我们想在单独的线程中运行代码1。
</p>

<p>
Lambda表达式的另一个常见用途是在集合中进行筛选和排序。例如，我们可以使
用lambda表达式来筛选出一个字符串列表中长度大于5的字符串。这个lambda表
达式可以传递给Java 8中的stream()方法，该方法提供了一种简单而强大的方法
来处理集合2。
</p>

<p>
reference: 
</p>
<ol class="org-ol">
<li><a href="https://stackoverflow.com/questions/32775164/lambda-expression-use-case-and-connection-with-functional-interface">https://stackoverflow.com/questions/32775164/lambda-expression-use-case-and-connection-with-functional-interface</a></li>
<li><a href="https://docs.oracle.com/javase/tutorial/java/javaOO/lambdaexpressions.html">https://docs.oracle.com/javase/tutorial/java/javaOO/lambdaexpressions.html</a></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org6ae5470" class="outline-2">
<h2 id="org6ae5470"><span class="section-number-2">4</span> 事件机制</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5cd3cbe" class="outline-3">
<h3 id="org5cd3cbe"><span class="section-number-3">4.1</span> What is event?</h3>
<div class="outline-text-3" id="text-4-1">
<p>
In Java, an <b>event</b> is something that happens when you interact with a program. For example, when you click a button on a website or press a key on your keyboard, that’s an event.
</p>

<p>
When an <b>event</b> happens in Java, it can trigger some code to run. This code is called an <b>event handler</b>. The <b>event handler</b> is responsible for responding to the event and performing some action based on the <b>event</b> that occurred.
</p>

<p>
Java provides the <code>java.awt.event</code> package which contains many event
classes and listener interfaces for event handling. An <b>event source</b>
is typically a <b>component or model</b>, but other types of objects can
also be event sources. Each event is <b>represented</b> by an object that
provides information about the event and identifies the event source.
</p>

<p>
For example, let’s say you have a button on your website that says
“Click me”. When someone clicks that button, it generates an
<b>event</b>. The button is an <b>event source</b>. You can write some code that
listens for that event and performs some action when the button is
clicked. This code is called an <b>event handler</b>.
</p>
</div>
