art/note/j09.org
*** 

For example, you create a button. There is a method called
~addActionListner(listener)~ . It is method to add listener to the
button. When there is an event, the added listener will be called. Of
course, you need construct the listener yourself. 

#+BEGIN_SRC
class MyListener implements ActionListener{
      @Override
      public void actionPerformed(ActionEvent event){
             // code is placed here. 
      }
}
#+END_SRC

The code above defines a listener class. One shall use an instance of
the class to insert it into the ~button~ class or other class using

#+BEGIN_SRC
button.addActionListner(listener)
#+END_SRC

When an event is created, it is passed to the listener method you
just inserted. Then the ~button~ will called the ~actionPerformed~
function in the ~Mylistener~ class. 

下面是一个例子. 

先是一个 ~make Button~ 方法的定义. 其根据参数, 创造了一个 Button, 然后
将其插到 ~buttonPanel~ 中.

#+BEGIN_SRC
void makeButton (String name, Color backgroundColor){
     var button = new JButton (name);
     buttonPanel.add(button);
     button.addActionListner(event->
        buttonPanel.setBackground(backgroundColor));
}
#+END_SRC

这里创建出的 ~button~ 的 ~listener~ 已经赋值了. 使用的是 lambda
expression. 

随后我们有

#+BEGIN_SRC
//客户端代码
buttonPanel = new JPanel();
add(buttonPanel);

makeButton("yellow", Color.YELLOW);
makeButton("green", Color.Green);
makeButton("blue", Color.BLUE);
makeButton("red", Color.RED);
#+END_SRC



* Swing 基本用户组件