art/note/j09.html

<div id="outline-container-org8421f24" class="outline-4">
<h4 id="org8421f24"><span class="section-number-4">4.1.1</span> </h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
For example, you create a button. There is a method called
<code>addActionListner(listener)</code> . It is method to add listener to the
button. When there is an event, the added listener will be called. Of
course, you need construct the listener yourself. 
</p>

<pre class="example">
class MyListener implements ActionListener{
      @Override
      public void actionPerformed(ActionEvent event){
             // code is placed here. 
      }
}
</pre>

<p>
The code above defines a listener class. One shall use an instance of
the class to insert it into the <code>button</code> class or other class using
</p>

<pre class="example">
button.addActionListner(listener)
</pre>

<p>
When an event is created, it is passed to the listener method you
just inserted. Then the <code>button</code> will called the <code>actionPerformed</code>
function in the <code>Mylistener</code> class. 
</p>

<p>
下面是一个例子. 
</p>

<p>
先是一个 <code>make Button</code> 方法的定义. 其根据参数, 创造了一个 Button, 然后
将其插到 <code>buttonPanel</code> 中.
</p>

<pre class="example">
void makeButton (String name, Color backgroundColor){
     var button = new JButton (name);
     buttonPanel.add(button);
     button.addActionListner(event-&gt;
        buttonPanel.setBackground(backgroundColor));
}
</pre>

<p>
这里创建出的 <code>button</code> 的 <code>listener</code> 已经赋值了. 使用的是 lambda
expression. 
</p>

<p>
随后我们有
</p>

<pre class="example">
//客户端代码
buttonPanel = new JPanel();
add(buttonPanel);

makeButton("yellow", Color.YELLOW);
makeButton("green", Color.Green);
makeButton("blue", Color.BLUE);
makeButton("red", Color.RED);
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-orge695c59" class="outline-2">
<h2 id="orge695c59"><span class="section-number-2">5</span> Swing 基本用户组件</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-04-18 Tue 21:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>